<template>
    <div id="OrderDetail">
        <b-container fluid>
            <b-row>
                <b-col lg='12' md='12'>
                    <TitledCard title="訂單紀錄:">
                        <div class="OrderTable">
                            <b-table class="OrderTable" sticky-header :items="items">
                            </b-table>
                        </div>
                    </TitledCard>
                </b-col>
            </b-row>
        </b-container>
    </div>
</template>

<script>
    import TitledCard from '@/components/Card/TitledCard.vue'

    export default {
        name: "OrderDetail",
        components: {
            TitledCard,
        },
        data() {
            return {
                items: [{
                    訂單編號: "TH-TH001",
                    訂單金額: "2,500 NT",
                    訂單狀態: "已完成",
                    下單時間: "2020/05/23 14:53",
                    完成時間: "2020/06/23 8:24"
                }, {
                    訂單編號: "TH-TH001",
                    訂單金額: "2,500 NT",
                    訂單狀態: "已完成",
                    下單時間: "2020/05/23 14:53",
                    完成時間: "2020/06/23 8:24"
                }, {
                    訂單編號: "TH-TH001",
                    訂單金額: "2,500 NT",
                    訂單狀態: "已完成",
                    下單時間: "2020/05/23 14:53",
                    完成時間: "2020/06/23 8:24"
                }, {
                    訂單編號: "TH-TH001",
                    訂單金額: "2,500 NT",
                    訂單狀態: "已完成",
                    下單時間: "2020/05/23 14:53",
                    完成時間: "2020/06/23 8:24"
                }, {
                    訂單編號: "TH-TH001",
                    訂單金額: "2,500 NT",
                    訂單狀態: "已完成",
                    下單時間: "2020/05/23 14:53",
                    完成時間: "2020/06/23 8:24"
                }, {
                    訂單編號: "TH-TH001",
                    訂單金額: "2,500 NT",
                    訂單狀態: "已完成",
                    下單時間: "2020/05/23 14:53",
                    完成時間: "2020/06/23 8:24"
                }, {
                    訂單編號: "TH-TH001",
                    訂單金額: "2,500 NT",
                    訂單狀態: "已完成",
                    下單時間: "2020/05/23 14:53",
                    完成時間: "2020/06/23 8:24"
                }, {
                    訂單編號: "TH-TH001",
                    訂單金額: "2,500 NT",
                    訂單狀態: "已完成",
                    下單時間: "2020/05/23 14:53",
                    完成時間: "2020/06/23 8:24"
                }, {
                    訂單編號: "TH-TH001",
                    訂單金額: "2,500 NT",
                    訂單狀態: "已完成",
                    下單時間: "2020/05/23 14:53",
                    完成時間: "2020/06/23 8:24"
                }, {
                    訂單編號: "TH-TH001",
                    訂單金額: "2,500 NT",
                    訂單狀態: "已完成",
                    下單時間: "2020/05/23 14:53",
                    完成時間: "2020/06/23 8:24"
                }, {
                    訂單編號: "TH-TH001",
                    訂單金額: "2,500 NT",
                    訂單狀態: "已完成",
                    下單時間: "2020/05/23 14:53",
                    完成時間: "2020/06/23 8:24"
                }, ]
            }
        }
    }
</script>