<template>
    <div id="UserNoteDetail">
        <b-container fluid>
            <b-row>
                <b-col lg='12' md='12'>
                    <TitledCard title="用戶評分和評論:">
                        <div class="NoteTable">
                            <b-table class="NoteTable" sticky-header :items="items">
                            </b-table>
                        </div>
                    </TitledCard>
                </b-col>
            </b-row>
        </b-container>
    </div>
</template>
<script>
    import TitledCard from '@/components/Card/TitledCard.vue'

    export default {
        name: "UserNoteDetail",
        components: {
            TitledCard,
        },
        data() {
            return {
                items: [{
                        訂單編號: "TH-T001",
                        師傅評分: "3",
                        客戶評分: "4",
                        師傅評論: "客戶給師傅的評論...",
                        客戶評論: "師傅給客戶的評論..."
                    },
                    {
                        訂單編號: "TH-T001",
                        師傅評分: "3",
                        客戶評分: "4",
                        師傅評論: "客戶給師傅的評論...",
                        客戶評論: "師傅給客戶的評論..."
                    },
                    {
                        訂單編號: "TH-T001",
                        師傅評分: "3",
                        客戶評分: "4",
                        師傅評論: "客戶給師傅的評論...",
                        客戶評論: "師傅給客戶的評論..."
                    },
                    {
                        訂單編號: "TH-T001",
                        師傅評分: "3",
                        客戶評分: "4",
                        師傅評論: "客戶給師傅的評論...",
                        客戶評論: "師傅給客戶的評論..."
                    },
                    {
                        訂單編號: "TH-T001",
                        師傅評分: "3",
                        客戶評分: "4",
                        師傅評論: "客戶給師傅的評論...",
                        客戶評論: "師傅給客戶的評論..."
                    },
                    {
                        訂單編號: "TH-T001",
                        師傅評分: "3",
                        客戶評分: "4",
                        師傅評論: "客戶給師傅的評論...",
                        客戶評論: "師傅給客戶的評論..."
                    },
                    {
                        訂單編號: "TH-T001",
                        師傅評分: "3",
                        客戶評分: "4",
                        師傅評論: "客戶給師傅的評論...",
                        客戶評論: "師傅給客戶的評論..."
                    },
                    {
                        訂單編號: "TH-T001",
                        師傅評分: "3",
                        客戶評分: "4",
                        師傅評論: "客戶給師傅的評論...",
                        客戶評論: "師傅給客戶的評論..."
                    },
                    {
                        訂單編號: "TH-T001",
                        師傅評分: "3",
                        客戶評分: "4",
                        師傅評論: "客戶給師傅的評論...",
                        客戶評論: "師傅給客戶的評論..."
                    },
                    {
                        訂單編號: "TH-T001",
                        師傅評分: "3",
                        客戶評分: "4",
                        師傅評論: "客戶給師傅的評論...",
                        客戶評論: "師傅給客戶的評論..."
                    },
                    {
                        訂單編號: "TH-T001",
                        師傅評分: "3",
                        客戶評分: "4",
                        師傅評論: "客戶給師傅的評論...",
                        客戶評論: "師傅給客戶的評論..."
                    },
                    {
                        訂單編號: "TH-T001",
                        師傅評分: "3",
                        客戶評分: "4",
                        師傅評論: "客戶給師傅的評論...",
                        客戶評論: "師傅給客戶的評論..."
                    },
                    {
                        訂單編號: "TH-T001",
                        師傅評分: "3",
                        客戶評分: "4",
                        師傅評論: "客戶給師傅的評論...",
                        客戶評論: "師傅給客戶的評論..."
                    },
                ]
            }
        }
    }
</script>